recepuysal/STM32_NucleoG474/exti_button_led/Inc/stm32g4xx_hal_conf.h
/**
 ******************************************************************************
 * @file    stm32g4xx_hal_conf.h
 * @brief   Minimal HAL configuration for the exti_button_led example.
 *          Only the modules actually needed (RCC, GPIO, DMA, EXTI, FLASH,
 *          PWR, CORTEX) are enabled to keep the build small. GPIO's own
 *          HAL_GPIO_EXTI_IRQHandler()/HAL_GPIO_EXTI_Callback() cover the
 *          external interrupt, so no separate EXTI source file is needed
 *          beyond stm32g4xx_hal_gpio.c.
 ******************************************************************************
 */

#ifndef STM32G4xx_HAL_CONF_H
#define STM32G4xx_HAL_CONF_H

#ifdef __cplusplus
extern "C" {
#endif

/* ########################## Module Selection ############################## */
#define HAL_MODULE_ENABLED
#define HAL_CORTEX_MODULE_ENABLED
#define HAL_DMA_MODULE_ENABLED
#define HAL_EXTI_MODULE_ENABLED
#define HAL_FLASH_MODULE_ENABLED
#define HAL_GPIO_MODULE_ENABLED
#define HAL_PWR_MODULE_ENABLED
#define HAL_RCC_MODULE_ENABLED

/* ########################## Oscillator Values adaptation ####################*/
#if !defined (HSE_VALUE)
#define HSE_VALUE    (8000000UL)
#endif

#if !defined (HSE_STARTUP_TIMEOUT)
#define HSE_STARTUP_TIMEOUT    (100UL)
#endif

#if !defined (HSI_VALUE)
#define HSI_VALUE    (16000000UL)
#endif

#if !defined (HSI48_VALUE)
#define HSI48_VALUE   (48000000UL)
#endif

#if !defined (LSI_VALUE)
#define LSI_VALUE  (32000UL)
#endif

#if !defined (LSE_VALUE)
#define LSE_VALUE    (32768UL)
#endif

#if !defined (LSE_STARTUP_TIMEOUT)
#define LSE_STARTUP_TIMEOUT    (5000UL)
#endif

#if !defined (EXTERNAL_CLOCK_VALUE)
#define EXTERNAL_CLOCK_VALUE    (48000UL)
#endif

/* ########################### System Configuration ######################### */
#define  VDD_VALUE                    (3300UL)
#define  TICK_INT_PRIORITY            (0x0FUL)
#define  USE_RTOS                     0U
#define  PREFETCH_ENABLE              0U
#define  INSTRUCTION_CACHE_ENABLE     1U
#define  DATA_CACHE_ENABLE            1U

/* ########################## Assert Selection ############################## */
/* #define USE_FULL_ASSERT               1U */

/* Includes ------------------------------------------------------------------*/
#ifdef HAL_RCC_MODULE_ENABLED
#include "stm32g4xx_hal_rcc.h"
#endif

#ifdef HAL_GPIO_MODULE_ENABLED
#include "stm32g4xx_hal_gpio.h"
#endif

#ifdef HAL_DMA_MODULE_ENABLED
#include "stm32g4xx_hal_dma.h"
#endif

#ifdef HAL_CORTEX_MODULE_ENABLED
#include "stm32g4xx_hal_cortex.h"
#endif

#ifdef HAL_EXTI_MODULE_ENABLED
#include "stm32g4xx_hal_exti.h"
#endif

#ifdef HAL_FLASH_MODULE_ENABLED
#include "stm32g4xx_hal_flash.h"
#endif

#ifdef HAL_PWR_MODULE_ENABLED
#include "stm32g4xx_hal_pwr.h"
#endif

/* Exported macro ------------------------------------------------------------*/
#ifdef  USE_FULL_ASSERT
#define assert_param(expr) ((expr) ? (void)0U : assert_failed((uint8_t *)__FILE__, __LINE__))
void assert_failed(uint8_t *file, uint32_t line);
#else
#define assert_param(expr) ((void)0U)
#endif

#ifdef __cplusplus
}
#endif

#endif /* STM32G4xx_HAL_CONF_H */
